// //Напишите программу. которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.

// Console.WriteLine( "Введите число " );
// int number = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine(Sum(number));

// int Sum(int number)
// {
//     int sum = 0;
//     int count = 1;
//     while(count<=number)
//     {
//         sum = sum + count;
//         count++;

//     }
//     return sum;
// }