// //Напишите программу, которая на вход принимает трёхзначное число и на выходе показывает вторую цифру этого числа

// int number = new Random().Next(100, 1000);

// int number1 = number / 10;
// int number2 = number1 % 10;

// Console.WriteLine(number+ " -> " +number2);